---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricSheetOverallLength
source: html/64ce2f4e-ff8c-034a-26bb-19414190d366.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricSheetOverallLength Property

"Overall Length": Overall Length

## Syntax (C#)
```csharp
public static ForgeTypeId FabricSheetOverallLength { get; }
```